var local_database = [
  {
    date: " 2017-08-08",
    title: "《战狼2》",
    imgSrc: "/images/logo/logo1.jpg",
    avatar: "/images/avatar/1.png",
    content: "凑热闹的也去看了此剧。看完之后第一感觉就是，似乎无法总结这出戏到底想说明什么，没有较核心骨的精神或情怀体现。",
    reading: "12",
    collection: "96",
    headImgSrc: "/images/logo/logo1.jpg",
    author: "哈皮",
    dateTime: "大众影评网",
    detail: "凑热闹的也去看了此剧。看完之后第一感觉就是，似乎无法总结这出戏到底想说明什么，没有较核心骨的精神或情怀体现。电影嘛，2个小时，要浓缩成一个有曲折有深度的故事情节，确实很难做到，但总得体现一些什么，比如一些价值观的树立，或许一种精神的引领，亦或一种情怀的渲染，但这出戏似乎挺凌乱，整个就是永无止境的打斗。视听效果，在电影里确实非常重要，比如赛车的碰撞声、建筑物的倒塌声、子弹导弹的呼啸轰炸声、刀剑的锵铛声等等都可以做为电影视听效果为之震憾的声音，但都要出奇不遇的发出才能震慑人心，如果整个2个小时的时间都是这些声音，只会让人心累啊。故事情节，因为不是故事片，框为动作片，所以确实无需太多太深的情感故事发生，那就尽量不要让故事情节凌散，细节强插硬塞，也没什么交待，就一闪而过。题材用的是军队的精神，但是是想体现军队的哪部份精神呢，比如集结号，大家一想起就是“军人的服从性”、又比如湄公河，大家一想起就是“军人对侨民性命的担当“，围绕一个点来撑开就行了，这样更能体现军人的精神。而这部电影是想要体现军人的方方面面，又要表现军人兄弟手足之情、又插播军中情缘、又要说明军人纪律严明(赵东来一直在等上级命令才能炮轰，这个等上级命令怎么像《人民名义》里抓反贪的情节) 、又要顾及侨民及老百姓的性命担当、又要体现军人不怕困难不怕牺牲、后面还加段和美籍女医生的暧昧情节（看来吴京也粉过《太阳的后裔》），故事情节好多噢，太多重点就变得没重点了，想体现越多东西越体现不出主题。但趁着八一体现军人们的风采，这个开映时间倒是选对了，总比在圈中晒病毒式的军装照来得有意义。好吧，就当是一部纯动作片来看吧，几个武打大咖的动作风格和武打中的互动给我留下较深的各自印记，成龙的武打片动作招数幽默诙谐，出其不意，他的对手总能在观众笑声中被打败，所以看他的武打戏会觉得没压力；甄子丹的动作犀利，感觉很有爆发力，看他的武打戏会觉得心里很痛快，坏人罪有应得，死得其所；虽然派风不一致，但打斗逻辑进程和情景穿插也是为配合他们本身的派风而显得易理解易推敲。而这出戏的武打动作及情景置入感觉有点过多，虽然都本着“好人永远打不死”的精神在作战，但逻辑过于波折，又要往前冲交义无反顾毫无计划的去救人，没救到主要人物却捞到了一美女，途中中了瘟疫死不了，注了血清又满血复活，枪林弹雨中行走，戳心挖脑也死不了。最后又冒出个“护照”出来，是想体现“爱国”估计。唉，要体现的东西太多了！多到我只记得“打斗”二字。",
    postId: 0,
    music: {
      url: "http://ws.stream.qqmusic.qq.com/C100003507bR0gDKBm.m4a?fromtag=38",
      title: "夜夜夜夜-齐秦",
      coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000001TEc6V0kjpVC.jpg?max_age=2592000"
    }
  },
  {
    title: "《敦刻尔克》",
    content: "《敦刻尔克》又再次延续诺兰的不败传奇生涯至今还是仍未踢到铁板持续拍出一部部令人惊艳的好电影即使这次是诺兰第一次执导战争片但丝毫未见到一丝丝生疏及缺失依然如此完美无瑕和扣人心弦而奥斯卡欠他已久的小金人这次总该颁给他了吧！",
    imgSrc: "/images/logo/logo2.jpg",
    reading: 62,
    detail: "《敦刻尔克》有别于一般战争电影，没有鲜血淋漓的伤患及死者，也没有大家耳熟能详的伟大历史人物，甚至连一个反派角色（敌军）的身影都没见着。全片将重心放在战争最前线的一兵一卒上，那些直接了当面对炮火及子弹的小人物上。《敦刻尔克》又再次的玩了诺兰导演最爱的「时间」元素，从过往的作品如《星际穿越》、《盗梦空间》、《致命魔术》等片皆是将时间的概念玩到透彻尽兴。而此片也是如此的将故事切成三个时间轴，分别为海陆空的一周、一天、一小时，再将其交错覆叠如扇形一般的呈现出来。《敦刻尔克》全片的对白并不多，也无特别的主轴故事线，也无多费心思在描摹角色的背景，但却能用一种壮阔磅礴的摄影，及震慑人心的配乐及音效和让人身历其境的画面来说出这段历史佳话。",
    collection: 92,
    dateTime: "烂番茄",
    headImgSrc: "/images/logo/logo2.jpg",
    author: "佚名",
    date: "2017-07-26",
    avatar: "/images/avatar/1.png",
    postId: 1,
    music: {
      url: "http://dl.stream.qqmusic.qq.com/C400003OUlho2HcRHC.m4a?vkey=6EF615249B6AD13E47DC4EC8D2C7D0062656DA2DF26A01B3D7AC1A42942B11C11DF33A278E0E5C021DFD05FBAFD74DB4A79D73DA54B87761&guid=8260319306&uin=0&fromtag=66",
      title: "告白气球-周杰伦",
      coverImg: "https://y.gtimg.cn/music/photo_new/T002R300x300M000003RMaRI1iFoYd.jpg?max_age=2592000"
    }
  },
  {
    //按住alt + shift + F 可以格式化代码样式
    title: "《三生三世十里桃花》",
    content: "先从人物来说，杨洋的墨渊太稚嫩、刘司音太老、人物关系应该倒过来、杨墨渊不是放低声音装深沉就可以扮老的好伐、真被你的演技吓坏了！西方仙境严重的水土不服。",
    detail: "先从人物来说，杨洋的墨渊太稚嫩、刘司音太老、人物关系应该倒过来、杨墨渊不是放低声音装深沉就可以扮老的好伐、真被你的演技吓坏了！重点说一下杨夜化和刘素素这一节！去看的童鞋们一定要紧闭你们的双眼，答应我。但看到这一段时我仿佛回到了致青春2的片场、杨夜华猥琐猥琐具猥琐、油腻油腻剧油腻。你是九重天上的太子啊！不是人间的三教九流地痞流氓、演的是啥？ 还有刘亦菲被非礼后那一声大吼！卧槽！哪个男人走错了片场？这个是温柔加温柔的素素？这就是一个豪放的男人。至于刘白浅穿个婚纱就跑出来我也无话可说、白浅姑姑虽然是不拘小节受人尊敬、但没让你演成汉子啊！",
    imgSrc: "/images/logo/logo3.jpg",
    headImgSrc: "/images/logo/logo3.jpg",
    reading: 32,
    collection: 92,
    author: "晚秋",
    date: "2017-08-03",
    dateTime: "豆瓣",
    avatar: "/images/avatar/3.png",
    postId: 2,
    music: {
      url: "http://ws.stream.qqmusic.qq.com/C100004HLusI2lLjZy.m4a?fromtag=38",
      title: "女儿情-万晓利",
      coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000004Wv5BO30pPc0.jpg?max_age=2592000"
    }
  },
  {
    title: "《肖申克的救赎》",
    content: "Andy Dufresne，一个永垂电影史册的名字。关于《The Shawshank Redemption》的评论，太多，该说的差不多都已说了千万遍。对于这样一个热门的话题，再想要抒发一些个人的喜爱之情，不免有拾人牙慧之嫌。",
    imgSrc: "/images/logo/logo4.jpg",
    reading: 45,
    detail: "Andy Dufresne，一个永垂电影史册的名字。\r\n1、关于相关影评，太多，该说的差不多都已说了千万遍。对于这样一个热门的话题，再想要抒发一些个人的喜爱之情，不免有拾人牙慧之嫌。为了避免这样没新意的事情发生，许多单词我就不再提了，譬如“希望”，譬如“自由”。当然，这些都是很好很好的，也是可以第一时间从电影里感受到的。那么，我先说说我曾经感受到过的另一个单词，“理性”。安迪的胜利是理性的胜利，安迪的成功是理性的成功。无论面临怎样的局面，顺境也好，逆境也罢，他都不动声色，默默地审时度势，做他能做的努力，以达成自己的目标。这是一种伟大的才华人类是感性的动物，时常受到情绪的支配，这是人之常情。面对残酷的环境，人本能的反应便是奋力抗争，而当这个环境恶劣到一定的程度时，人的抗争之心就会慢慢被消磨殆尽，成为行尸走肉。这两种情况，都是在许多文学影视作品中可以看到的。肖申克的囚犯也大都如此。在入狱之前，他们想必大都是目无法纪为非作歹的凶徒，人性中叛逆抗争的一面应该比常人要猛烈得多。但是长期被囚禁的生活，对权威的恐惧，对未来的绝望，对体制的顺应，使他们逐渐成为了去掉獠牙的狼。但冲动的血性并没有消失，囚犯之间时不时地争斗，“三姐妹”的恃强凌弱，都是证明。但，这一切都臣服于肖申克的石墙之内。就像驯服的狼被一起圈禁在铁栅栏中，也会彼此斗殴撕咬。这是动物的本性，也是人类的本性。 安迪的伟大之处，便在于他超越了这种本性，在它上方数万英里高空的地方，用人类的理性俯视着这一切。典狱长的冷酷，狱警的残暴，“三姐妹”的兽欲，他当然从心底里反抗。他的抗争看起来如此虚弱无力，但却如此又坚定持久。他在用他的智慧和理性反抗这一切。有的时候，他看似已经忍气吞声，但很快我又欣喜地发现，他始终不曾屈服。当“三姐妹”强迫他口交的时候，他一番心平气和的叙述让对方无计可施；同样的，当狱警头子恶狠狠的要将他推下屋顶之时，他仍是面不改色地说出一番话来，立刻说服了对方。面目狰狞穷凶极恶的是他们，但真正咄咄逼人的，却是他。老瑞德曾经看错了安迪，以为他只是一个普通的知识分子，没有霸气，没有血性，是个软弱的人。没错，安迪没有张扬的锋芒，人性中野蛮与粗暴的一面，在他体内都已凝炼成了理性，从而爆发出更加巨大的能量。我想，瑞德一定庆幸他输掉了那两包烟。\r\n2、接着我想说的是，“毅力”。这个力量或许和前面所说的“理性”有些关联。人都有一时冲动的时候，那一刻会爆发出平常所没有的力量，叫做爆发力。对短跑运动员来说，爆发力很重要。然而那一刻爆发的力量是有限的，它会被一种叫做时间的东西消磨。这个力量来自于人的本能，像顽石一样不经琢磨。而“毅力”却是琢磨而出的。时间不断的腐蚀它，而理性不断的加固它。这是一场艰苦卓绝的拉锯战。安迪可以坚持每天挖掘石洞，挖了近二十年；可以每周写一封信，后来每周写两封信，直到州政府给了回应，资助他建立起图书馆；可以穿越长达五百米的恶臭肮脏的下水道，逃离肖申克。这样的毅力不只是可敬可佩，简直是可怖。我没有毅力。我只会被时间消磨成一堆灰，一堆沙，而安迪却被琢磨成了钻石。他让我激动，是因为他身上的“理性”和“毅力”是我所没有的。我推想安迪从哪一天开始生起了挖洞逃生的念头。也许是他刻下名字的那一刻，他发现石墙的质地松动，可能使他成功，于是他开始奋斗。但我想，这个念头一定在那之前就有，一定是这种想要摆脱困境的念头，与他百折不挠的精神，使他成为一个出色的银行家。而后，使他成为一个出色的逃犯。接着，在电影结束之后，他必将成为一个出色的开拓者。\r\n3、瑞德说，你不是罪犯，也许，不是个好丈夫。安迪却不这么认为，他痛心疾首，认为是他的性格害了他的妻子。他很爱她，但是不善于表达，她说他就像一本阖上的书，永远不知道他在想什么。其实从电影一开始，我就明白了为什么安迪的妻子会红杏出墙。当然，他很出色，他不只是有才华，还有一种奇妙的人格魅力。但是这不是爱情的基础，起码，他的妻子并不因此而爱他。有人说这是部“男人必看”的电影，我想除了因为这部电影宣扬了理性、希望、奋斗之外，还因为其中有一种男人之间的友情。安迪的魅力没有吸引到他的妻子，却深深吸引了他身边的囚犯兄弟，特别是瑞德。瑞德是个老大哥般的人物，慷慨任侠，老成世故，颇有头脑。他在监狱里法力无边，若不是最初他帮助安迪搞到了许多工具，安迪也无法完成越狱的奇迹。他战胜了一切，却输给了，Forrest Gump。",
    collection: 92,
    dateTime: "豆瓣",
    headImgSrc: "/images/logo/logo4.jpg",
    author: "佚名",
    date: "2006-06-12",
    avatar: "/images/avatar/5.png",
    postId: 3,
    music: {
      url: "http://dl.stream.qqmusic.qq.com/C400003v4UL61IYlTY.m4a?vkey=33D78FC65EECF23D772D8F9400C0FC5D1DB5825BE085A7724448A098E8F1E71DF3C872966DF6F447DEF1E12628BA4D6C983FC14025B7F517&guid=8260319306&uin=0&fromtag=66",
      title: "暧昧-薛之谦",
      coverImg: "https://y.gtimg.cn/music/photo_new/T002R300x300M000004FES4i1g0uWJ.jpg?max_age=2592000",
    }
  },
  {
    title: "《猩球崛起3：终极之战》",
    content: "故事的时间是发生在《猩球崛起2：黎明之战》的两年后，人类出现新的上校军官，拥有残暴且冷血的好战个性，目标只为了将猩猩族群给一一消灭殆尽。",
    imgSrc: "/images/logo/logo5.png",
    reading: 15,
    detail: "故事的时间是发生在《猩球崛起2：黎明之战》的两年后，人类出现新的上校军官，拥有残暴且冷血的好战个性，目标只为了将猩猩族群给一一消灭殆尽。凯萨为了保护族群不得不奋起反击，但在过程中其妻小却惨遭人类的杀害。在凯萨心中那股黑暗的复仇力量渐渐油然而生。1968年《人猿星球》那五部曲虽然品质参差不齐，但当年上映后造成便造成极大的轰动及热议更影射了美国极为严重的种族歧视及社会阶级问题。使其成为伟大且极为经典的作品2001年Tim Burton执导的重启作品《决战猩球》虽然票房取得巨大的成功但评价及口碑却惨不忍睹。10年后的2011年Rupert Wyatt再度重起了此系列，到了2017年已经到了凯萨一生三部曲的最终章。《猩球崛起3》并没有繁琐复杂的台词对话，也没有过多的爆破战争场面，反倒用一种较为压抑的风格，靠着引人入胜的剧情及恰如其分的配乐取胜。即使电影长度高达140分钟长却也未见任何一个尿点及乏味之处。",
    collection: 26,
    dateTime: "烂番茄",
    headImgSrc: "/images/logo/logo5.png",
    author: "佚名",
    date: "2017-07-15",
    avatar: "../../../images/avatar/3.png",
    postId: 4,
    music: {
      url: "http://dl.stream.qqmusic.qq.com/C400002G0sJY2wThyx.m4a?vkey=9F0CA3AEEA454659E53A14348058F74B95D8265BA7A7B8B001C4A7FC62DCF9959EB5AB773B003AB85704667BE68DFB0017465831922E3231&guid=8260319306&uin=0&fromtag=66",
      title: "喜欢你-邓紫棋",
      coverImg: "https://y.gtimg.cn/music/photo_new/T002R300x300M000000cFPKx3ZGzks.jpg?max_age=2592000"
    }
  }
]

module.exports = {
  postList: local_database
}